<template>
    <v-main class="grey lighten-2">
        <v-container  class="text-center">
            <v-avatar size="256">
                <img
                        :src="require('../components/master.jpg')"
                        alt="John"
                >
            </v-avatar>
            <H2>Здравствуйте.</H2>
            <h4>Моё имя - Артем.</h4>

            <p>Я всегда хотел быть программистом, начиная с того времени, как я пытался (бросил, так как забрали в армию) писать игру (я боюсь смотреть на то, что тогда наваял, но она работала) до сего момента (мне 26 лет).
            Я пробовал учить c++, Pyton, js, c# и самым понятным и приятным для меня стал js. Так как я хочу видеть результаты моей работы и не особо люблю db - я выбрал фронт.
            </p>
            <p>В данный момент прохожу обучение в институте МАИ на 4м курсе.</p>
            <p>Вероятнее всего в вакансии вы мне откажите, так как с Vuetifi я в первый раз работал и скорее всего набралось уже достаточно много работ и резюме гораздо лучших чем мои, но это задание мне делать понравилось и кое-что новое я для себя открыл. Спасибо.</p>
            <h4>Навыки:</h4>
            <ul style="text-align: left">
                <li>JavaScript (написал на чистом js SPA-приложение. Сейчас многие вещи я там сделал бы по другому);</li>
                <li>Vue, vuex, vue-router (Пример работы: <a href="https://star-trader.ru">https://star-trader.ru/);</a></li>
                <li>SCSS CSS HTML;</li>
                <li>Опыт адаптивной и резиновой вёрстки.</li>
            </ul>
        </v-container>
    </v-main>
</template>

<script>
    export default {
        name: "AboutMe"
    }
</script>

<style scoped>

</style>